TrucoGame_Back-End/app/models/player.rb

  def discard(card)
    raise StandardError.new("La partida no ha empezado") if self.game.waiting?
    raise StandardError.new("La ya ha terminado") if self.game.finished?
    if(self.hand.include?(card))
---
SELECT "players".* FROM "players" WHERE "players"."game_id" = ? ORDER BY seat ASC  [["game_id", 1]]

  def deal
    raise StandardError.new("La partida no ha empezado") if self.game.waiting?
    raise StandardError.new("La ya ha terminado") if self.game.finished?

    if self.seat == self.game.deals
      self.game.reset_deck

      num_players = self.game.players.size
      cards_per_player = 3
      current_player_index = self.game.deals

      for _ in 1..cards_per_player
        for i in 0...num_players
          player = self.game.players[current_player_index]
          player.played = []
          player.hand << self.game.deck.pop
          player.save
---
SELECT "players".* FROM "players" WHERE "players"."game_id" = ? ORDER BY seat ASC  [["game_id", 3]]
UPDATE "games" SET "number" = ?, "deck" = ?, "updated_at" = ? WHERE "games"."id" = ?
UPDATE "players" SET "hand" = ?, "played" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["hand", "---\n- c12\n"], ["played", "--- []\n"], ["updated_at", "2023-08-24 02:46:25.658084"], ["id", 8]]

  def set_number
    if (self.game.players_count == 0)
      srand()
      self.game.number = self.user.username + "#" + rand(1000).to_s
      self.game.save
---
UPDATE "games" SET "number" = ?, "deck" = ?, "updated_at" = ? WHERE "games"."id" = ?